export default {
  login: {
    login: "ავტორიზაცია",
    username: "სახელი",
    password: "პაროლი",
    rememberMe: "დამიმახსოვრე",
    forgotPassword: "პაროლი დაგავიწყდათ?",
    createAccount: "შექმენით ახალი ანგარიში",
    loginUsing: "ავტორიზირდით",
    submit: "შესვლა",
  },
  register: {
    register: "რეგისტრაცია",
    username: "სახელი",
    email: "ელ. ფოსტა",
    password: "პაროლი",
    confirmPassword: "დაადასტურეთ პაროლი",
    submit: "შექმნა",
    alreadyHaveAnAccount: "უკვე გაქვთ ანგარიში?",
  },

  searchBar: {
    placeholder: "ძიება...",
  },
  landing: {
    phrase:
      "მსოფლიოს საუკეთესო აგრარული დანადგარები უკვე ხელმისაწვდომია შენთვის ნებისმიერ ადგილას. ჩვენ გთავაზობთ ყველაზე კარგ ხარისხს ყველაზე კარგ ფასად",
    subphrase: "ადგილი, სადაც შეგიძლიათ იპოვოთ ყველაფერი რაც გჭირდებათ",
    goToStore: "მაღაზიაში გადასვლა",
    stages: {
      first: {
        borderTitle: "საუკეთესო დანადგარები",
        title: "აღადგინე, განავითარე, დაიცავი",
        first:
          "ჩვენ მოწადინებულნი ვართ მოგაწოდოთ უმაღლესი ხარისხის სასოფლო-სამეურნეო ტექნიკა და ხელსაწყოები, რომლებიც უზრუნველყოფენ ფერმერების გარემოს კეთილდღეობას.",
        second:
          "დანადგარები, რომლებსაც ჩვენ გთავაზობთ გაძლევთ გარანტირებული წინსვლის შანს და მდგრადი მეურნეობის პრაქტიკას, რაც ხელს უწყობს მომავალს და გარემოზე დადებით ზეგავლენას.",
      },
      second: {
        borderTitle: "გარემო",
        title: "მდგრადი ენერგიის ინიციატივები",
        first:
          "აგროკულტში ჩვენი მიზანია შემოგთავაზოთ მდგრადობისა და გარემოს დაცვის უმაღლესი ხარისხი. ჩვენ ვაცნობიერებთ წყლისა და ენერგიის დაზოგვის კრიტიკულ მნიშვნელობას თანამედროვე სოფლის მეურნეობაში. ჩვენი დანადგარები გთავაზობთ ინოვაციურ სპექტრს, რომელიც შექმნილია ამ სასიცოცხლო საკითხების გადასაჭრელად.",
        second:
          "ჩვენი უახლესი სარწყავი სისტემები წარმოადგენენ მნიშვნელოვან ნახტომს წყლის მართვის ტექნოლოგიაში. მორწყვის ზუსტი ტექნიკის გამოყენებით, ეს სისტემები უზრუნველყოფენ წყლის მიწოდებას უშუალოდ მცენარის ფესვებში, რაც ამცირებს აორთქლებასა და ჩამონადენს.",
      },
      third: {
        borderTitle: "ჩვენი გუნდი",
        title: "ჩვენი ერთგული სოფლის მეურნეობის ექსპერტები",
        first:
          "ჩვენი გუნდის წევრები უფრო მეტია, ვიდრე უბრალოდ თანამშრომლები. ისინი ჩვენი კომპანიის ხერხემალი არიან. ზრდა და კეთილდღეობა ჩვენი უპირველესი მიზანია. ჩვენ ვიცით, რომ მათი გამოცდილება და ერთგულება განაპირობებს ჩვენს წარმატებას. ჩვენი ერთობლივი ვალდებულება სოფლის მეურნეობის ტექნოლოგიებში სრულყოფილებისადმი გვაქცევს ძლიერ და ინოვაციურ პარტნიორად ფერმერებისთვის ყველგან.",
      },
    },
    partners: {
      title: "ჩვენი პარტნიორები",
    },
  },

  header: {
    dropDown: {
      profile: "პროფილი",
      admin: "ადმინისტრატორი",
      logout: "გასვლა",
    },
  },

  admin: {
    navigation: {
      dashboard: "მთავარი",
      users: "მომხმარებები",
      products: "პროდუქტები",
      orders: "შეკვეთები",
      action_logs: "ჩანაწერები",
      tickets: "წერილები",
      go_back: "უკან",
    },

    dashboard: {
      title: "მთავარი",
      users: "მომხმარებლები",
      purchases: "შეკვეთები",
      new_users: "ახალი მომხმარებლები",
      todays_revenue: "დღის შემოსავლები",
      open_tickets: "მოთხოვნები",
    },

    users: {
      manage_users: "მომხმარებლების მართვა",
      placeholder: "სახელი..",
      search: "ძებნა",
      name: "სახელი",
      email: "ელ. ფოსტა",
      role: "როლი",
      id: "მომხმარებელი ID",
      action: "ქმედება",
      copy: "დაკოპირება",
      created_at: "შექმნის თარიღი",
      close: "დახურვა",
      submit: "ძიება",
    },
    store: {
      add_item: "დამატება",
      search: "ძებნა",
      search_item: "მოძებნე პროდუქტი..",
      id: "ID",
      name: "სახელი",
      price: "ფასი",
      category: "კატეგორია",
      actions: "ქმედება",
      title: "პროდუქტების მართვა",
      product: {
        title: "სახელი",
        description: "აღწერა",
        brand: "ბრენდი",
        category: "კატეგორია",
        details: "დეტალები",
        price: "ფასი",
        amount: "რაოდენობა",
        discount: "ფასდაკლება",
        edit: "რედაქტირება",
        submit: "დადასტურება",
        cancel: "გაუქმება",
      },
    },
    logs: {
      action_logs: "ჩანაწერები",
      id: "ID",
      performer_name: "ადმინისტრატორი",
      performer_id: "ადმ. ID",
      type: "ტიპი",
      action: "ქმედება",
      description: "აღწერა",
      timestamp: "დრო",
      copy: "დაკოპირება",
    },
  },

  navigation: {
    home: "მთავარი",
    store: "მაღაზია",
    profile: "პროფილი",
    blogs: "ბლოგები",
    about: "ჩვენს შესახებ",
    contact: "კონტაქტი",
    logout: "გასვლა",
  },
  about: {
    title: "ჩვენს შესახებ",
    openingParagraph:
      "AgroCult არის ლიდერი მომწოდებელი აგრიკულტურული დანადგარებისა და ხელსაწყოების. ჩვენი მიზანია დავეხმაროთ ფერმერებს და აგრიკულტურულ ბიზნესებს კავკასიაში, რომ განავითარონ თავიანთი პროდუქტიულობა, მდგრადობა და ეფექტურობა ინოვაციური ტექნოლოგიების დახმარებით",
    secondOpeningParagraph:
      "ჩვენ გთავაზობთ პროდუქტებისა და სერვისების დიდ ასორტიმენტს, რომლებიც შექმნილია თანამედროვე სოფლის მეურნეობის სხვადასხვა საჭიროებების დასაკმაყოფილებად, ზუსტი სარწყავი სისტემებიდან დაწყებული მოსავლის აღების უახლესი მოწყობილობებით დამთავრებული. სოფლის მეურნეობის ექსპერთა ჩვენი გუნდი მოწოდებულია უზრუნველყოს უმაღლესი დონის მომსახურება და მხარდაჭერა.",
    charities: {
      title: "AgroCult-ის ქველმოქმედება",
      openingParagraph:
        "Agrocult-ის ვალდებულება საზოგადოების მიმართ სცილდება ტექნოლოგიურ ინოვაციას. 2005 წელს კომპანიამ დაარსა Agrocult Charities, არაკომერციული ორგანიზაცია, რომელიც ეძღვნება სასოფლო-სამეურნეო თემების მხარდაჭერას მთელ მსოფლიოში. ამ ინიციატივით AgroCult-მა დააფინანსა მრავალი პროექტი, მათ შორის გვალვისგან დაზარალებულ რაიონებში ჭაბურღილების მშენებლობა, ახალგაზრდა ფერმერებისთვის საგანმანათლებლო პროგრამების შემუშავება და ბუნებრივი კატასტროფებით დაზარალებული რეგიონებისთვის სასწრაფო დახმარების გაწევა.",
      secondOpeningParagraph:
        "ჩვენ ასევე ვართ ძალიან დიდი მხარდამჭერები მსოფლიო შიმშილის პრობლემების მოგვარებისა. საერთაშორისო ორგანიზაციებთან თანამშრომლობით AgroCult ეხმარება საკვებით და უზრუნველყოფს რესურსებით რეგიონებს, რომლებშიც დაზარებულია მოსახლეობა. ჩვენი მიზანია, რომ გვქონდეს დიდი და აზრიანი შედეგი სამყაროს გლობალურ საკვებ ჯაჭვზე.",
    },
    futureGoals: {
      title: "Agrocult-ის მომავალი",
      openingParagraph:
        "ჩვენ ერთგულები ვრჩებით ძირითადი ღირებულებების და ვაპირებთ შევინარჩუნოთ უმაღლესი ხარისხის სერვისი მთლიან კავკასიაში. ჩვენ მუდამ ვცდილობთ მოვიძიოთ ახალი ტექნოლოგიები და ტექნიკები, რომ განვავითაროთ და უფრო ეფექტური გავხადოთ თანამედროვე აგროკულტურა, გარემოზე ზრუნვასთან ერთად. ჩვენი მიზანია ვიყოთ ლიდერი კომპანია აგროკულტურის სფეროში და წინ წავიყვანოთ ეს სფერო.",
      secondOpeningParagraph:
        "ჩვენ გეპატიჟებით და გთავაზობთ, რომ შემოგვიერთდეთ ამ მოგზაურობაში, რომელშიც ერთად ვიმუშავებთ სოფლის მეურნეობის უფრო ნათელი და უფრო მდგრადი მომავლის ჩამოსაყალიბებლად.",
    },
  },
  store: {
    search: {
      submit: "ძებნა",
      placeholder: "მოძებნე პროდუქტი..",
    },
    buy: "ყიდვა",
    categories: {
      any: "ყველა",
      tractors: "ტრაქტორები",
      plowers: "სახნავები",
      accessories: "აქსესუარები",
      fertilizers: "სასუქი",
      pesticides: "ფიტოციდები",
      tools: "ხელსაწყოები",
      livestock: "საქონელი",
      submit: "ძებნა",
    },
    sort: {
      title: "დალაგება",
      mostrelevant: "ყველაზე მნიშვნელოვანი",
      bestSelling: "ყველაზე გაყიდვადი",
      priceLowToHigh: "ფასი: დაბალი - მაღალი",
      priceHighToLow: "ფასი: მაღალი - დაბალი",
    },
    price: {
      title: "ფასი",
      from: "დან",
      to: "მდე",
    },
    brand: "ბრენდი",
    loadMore: "მეტის ჩვენება",
    loadLess: "ნაკლების ჩვენება",
    product: {
      description: "აღწერა",
      cantBuy: "დაგვიკავშირდით თუ გსურთ შეკვეთა",
      showMore: "მეტის ჩვენება",
      showLess: "ნაკლების ჩვენება",
      details: "დეტალები",
      price: "ფასი",
      amount: "რაოდენობა",
      discount: "ფასდაკლება",
    },
  },
  profile: {
    title: "პროფილის რედაქტირება",
    username: "სახელი",
    email: "ელ. ფოსტა",
    currentPassword: "ამჯამინდელი პაროლი",
    newPassword: "ახალი პაროლი",
    confirmPassword: "გაიმეორეთ ახალი პაროლი",
    submit: "შენახვა",
  },
  contact: {
    firstPhrase: {
      main: "სასწრაფოა? მიიღეთ დახმარება ლაივ ჩატით!",
      sub: "დააჭირეთ აქ",
    },
    secondPhrase: {
      main: "დაგვიკავშირდით ჩვენს ცხელ ხაზზე და გიპასუხებთ მალე!",
      sub: "+(XXX)-XXX-XXX",
    },
    thirdPhrase: {
      main: "მოგვწერეთ ელექტრონულ ფოსტაზე და მიიღეთ დახმარება!",
    },
    form: {
      title: "დაგვიკავშირდით",
      name: "სახელი",
      email: "ელ. ფოსტა",
      description: "აღწერა",
      topicLabel: "თემა",
      topics: {
        purchaseExclusive: "ექსკლუზიური შესყიდვა",
        billing: "გადახდის პრობლემა",
        transportation: "ტრანსპორტირების პრობლემა",
        account: "ანგარიშის პრობლემა",
        other: "სხვა",
      },
      submit: "გაგზავნა",
    },
  },
  footer: {
    rights: "© 2024 Agrocult. ყველა უფლება დაცულია",
    links: {
      trackShipment: "ამანათები",
      about: "ჩვენს შესახებ",
      contact: "კონტაქტი",
      profile: "პროფილი",
    },
  },
} as const;
